1. JPA에서 Entity를 설계할때 주의점이 무엇인가요?
 - etter를 사용하지 말 것. 
 - 모든연관계는 지연로딩
 - 컬렉션은 필드 초기화 하자 
 
2. DTO를 사용하는 이유에 대해 설명해보세요
  -  Entity가 아닌 DTO를 전달함으로써 각 레이어 간 역할을 분리할 수 있기 때문

3. N+1 문제에 대해 짧게 설명해보세요
  - 일대다,다대일 양방향 에서 즉시로딩의 경우 Jpql로 전달되는 과정에서 Jpql 후 Eager 감지로 인한 N쿼리가 추가로 발생

4. 생성자 injection을 사용하는 이유가 뭐라고 생각하시나요?
   - 생성자 호출시점에 딱 1번만 호출되는 것이 보장
   - 객체를 생성할 때 딱 1번만 호출되므로 이후에 호출되는 일이 없습니다.
     따라서 불변하게 설계
   - final 키워드 사용

5. Bean이란?
  - spring 컨테이너에서 관리되는 자바 객체

6. 직렬화(serialization)가 무엇인지 설명해보세요
  - Java 직렬화는 자바 시스템 내부에서 사용되는 객체 또는 데이터들을 외부의 자바 시스템에서도 사용할 수 있도록 바이트(byte) 형태로 데이터 변환하는 기술
  - 바이트로 변환된 데이터를 다시 객체로 변환하는 역직렬화를 포함
  - JVM에 힙 또는 스택에 상주하고있는 객체를 바이트코드로 변환하거나 직렬화된 바이트 코드를 다시 자바 객체로 역직렬화 하는것
